# Conhecendo a base de dados

## Importando os dados

In [1]:
import pandas as pd

In [7]:
url = 'https://raw.githubusercontent.com/moises-rb/DataScienceOne/refs/heads/main/Aprendendo_Fazer_ETL/Pandas/pandas-dados/alunos.csv'

dados_alunos = pd.read_csv(url, sep=',')

dados_alunos

         Nome  Idade  Notas  Aprovado
0         Ary     20    7.5      True
1         Ana     18    NaN     False
2       Cátia     27    2.5     False
3       Denis     18    5.0     False
4        Beto     21   10.0      True
5       Bruna     23    NaN     False
6        Dara     21    7.0      True
7      Carlos     19    6.0      True
8       Alice     35    5.6     False
9       Vitor     28    NaN     False
10     Daniel     21    NaN     False
11       Igor     24    4.5     False
12  Sthefanie     26    9.5      True
13      Mirla     25    9.0      True
14      Paulo     37    NaN     False
15     Mylena     29    7.0      True
16      Lucas     33    NaN     False
17      Nadia     34    8.0      True

# Tratando e filtrando os dados

## Lidando com dados nulos

In [11]:
dados_alunos.isnull()

     Nome  Idade  Notas  Aprovado
0   False  False  False     False
1   False  False   True     False
2   False  False  False     False
3   False  False  False     False
4   False  False  False     False
5   False  False   True     False
6   False  False  False     False
7   False  False  False     False
8   False  False  False     False
9   False  False   True     False
10  False  False   True     False
11  False  False  False     False
12  False  False  False     False
13  False  False  False     False
14  False  False   True     False
15  False  False  False     False
16  False  False   True     False
17  False  False  False     False

In [13]:
dados_alunos.isnull().sum()

Nome        0
Idade       0
Notas       6
Aprovado    0
dtype: int64

In [20]:
dados = dados_alunos.fillna(0)

In [21]:
dados.isnull().sum()

Nome        0
Idade       0
Notas       0
Aprovado    0
dtype: int64

## Remover os alunos "Alice" e "Carlos" da nossa base de dados.

In [22]:
# salvando os índices das linhas a serem removidas em uma variável
alunos_a_remover = dados.query('Nome == "Alice" | Nome == "Carlos"').index

In [23]:
# removendo as linhas referentes aos alunos "Alice" e "Carlos"
dados.drop(alunos_a_remover, axis=0, inplace=True)

## Realizar a seleção apenas dos alunos aprovados

In [24]:
selecao = dados['Aprovado'] == True

In [25]:
dados[selecao]

         Nome  Idade  Notas  Aprovado
0         Ary     20    7.5      True
4        Beto     21   10.0      True
6        Dara     21    7.0      True
12  Sthefanie     26    9.5      True
13      Mirla     25    9.0      True
15     Mylena     29    7.0      True
17      Nadia     34    8.0      True

In [26]:
alunos_aprovados = dados[selecao]

## Salvar o DataFrame apenas com os alunos aprovados.

In [27]:
alunos_aprovados.to_csv('alunos_aprovados.csv', index=False)

## Substituir os valores 7.0 por 8.0.

In [28]:
alunos_aprovados.replace(7.0, 8.0)

         Nome  Idade  Notas  Aprovado
0         Ary     20    7.5      True
4        Beto     21   10.0      True
6        Dara     21    8.0      True
12  Sthefanie     26    9.5      True
13      Mirla     25    9.0      True
15     Mylena     29    8.0      True
17      Nadia     34    8.0      True

In [29]:
alunos_aprovados = alunos_aprovados.replace(7.0, 8.0)
alunos_aprovados

         Nome  Idade  Notas  Aprovado
0         Ary     20    7.5      True
4        Beto     21   10.0      True
6        Dara     21    8.0      True
12  Sthefanie     26    9.5      True
13      Mirla     25    9.0      True
15     Mylena     29    8.0      True
17      Nadia     34    8.0      True

In [30]:
url = 'https://raw.githubusercontent.com/moises-rb/DataScienceOne/refs/heads/main/Aprendendo_Fazer_ETL/Pandas/pandas-dados/alunos.csv'

dados_alunos = pd.read_csv(url, sep=',')

dados_alunos

         Nome  Idade  Notas  Aprovado
0         Ary     20    7.5      True
1         Ana     18    NaN     False
2       Cátia     27    2.5     False
3       Denis     18    5.0     False
4        Beto     21   10.0      True
5       Bruna     23    NaN     False
6        Dara     21    7.0      True
7      Carlos     19    6.0      True
8       Alice     35    5.6     False
9       Vitor     28    NaN     False
10     Daniel     21    NaN     False
11       Igor     24    4.5     False
12  Sthefanie     26    9.5      True
13      Mirla     25    9.0      True
14      Paulo     37    NaN     False
15     Mylena     29    7.0      True
16      Lucas     33    NaN     False
17      Nadia     34    8.0      True

In [37]:
#dados_alunos['Pontos_extra'] = dados_alunos['Notas'] * 0.4 

dados_alunos['Pontos_extras'] = dados_alunos['Notas'].apply(lambda x: x*0.4)

dados_alunos.head()

    Nome  Idade  Notas  Aprovado  Pontos_extra  Pontos_extras
0    Ary     20    7.5      True           3.0            3.0
1    Ana     18    NaN     False           NaN            NaN
2  Cátia     27    2.5     False           1.0            1.0
3  Denis     18    5.0     False           2.0            2.0
4   Beto     21   10.0      True           4.0            4.0

In [38]:
dados_alunos['Notas_finais'] = dados_alunos['Notas'] + dados_alunos['Pontos_extras']

dados_alunos.head()

    Nome  Idade  Notas  Aprovado  Pontos_extra  Pontos_extras  Notas_finais
0    Ary     20    7.5      True           3.0            3.0          10.5
1    Ana     18    NaN     False           NaN            NaN           NaN
2  Cátia     27    2.5     False           1.0            1.0           3.5
3  Denis     18    5.0     False           2.0            2.0           7.0
4   Beto     21   10.0      True           4.0            4.0          14.0

In [39]:
dados_alunos['Aprovado_final'] = dados_alunos['Notas_finais'].apply(lambda x: True if x >= 6 else False)
dados_alunos

,Nome,Idade,Notas,Aprovado,Pontos_extra,Pontos_extras,Notas_finais,Aprovado_final
0,Ary,20,7.5,True,3.00,3.00,10.50,True
1,Ana,18,NaN,False,NaN,NaN,NaN,False
2,Cátia,27,2.5,False,1.00,1.00,3.50,False
3,Denis,18,5.0,False,2.00,2.00,7.00,True
4,Beto,21,10.0,True,4.00,4.00,14.00,True
5,Bruna,23,NaN,False,NaN,NaN,NaN,False
6,Dara,21,7.0,True,2.80,2.80,9.80,True
7,Carlos,19,6.0,True,2.40,2.40,8.40,True
8,Alice,35,5.6,False,2.24,2.24,7.84,True
9,Vitor,28,NaN,False,NaN,NaN,NaN,False
10,Daniel,21,NaN,False,NaN,NaN,NaN,False
11,Igor,24,4.5,False,1.80,1.80,6.30,True
12,Sthefanie,26,9.5,True,3.80,3.80,13.30,True
13,Mirla,25,9.0,True,3.60,3.60,12.60,True
14,Paulo,37,NaN,False,NaN,NaN,NaN,False
15,Mylena,29,7.0,True,2.80,2.80,9.80,True
16,Lucas,33,NaN,False,NaN,NaN,NaN,False
17,Nadia,34,8.0,True,3.20,3.20,11.20,True

In [40]:
dados_alunos.query('Aprovado == False & Aprovado_final == True')

,Nome,Idade,Notas,Aprovado,Pontos_extra,Pontos_extras,Notas_finais,Aprovado_final
3,Denis,18,5.0,False,2.00,2.00,7.00,True
8,Alice,35,5.6,False,2.24,2.24,7.84,True
11,Igor,24,4.5,False,1.80,1.80,6.30,True

In [41]:
selecao = (dados_alunos['Aprovado'] == False) & (dados_alunos['Aprovado_final'] == True)
dados_alunos[selecao]

,Nome,Idade,Notas,Aprovado,Pontos_extra,Pontos_extras,Notas_finais,Aprovado_final
3,Denis,18,5.0,False,2.00,2.00,7.00,True
8,Alice,35,5.6,False,2.24,2.24,7.84,True
11,Igor,24,4.5,False,1.80,1.80,6.30,True